[Killed] BlockStatement
main/components/Auth/SignInCard.js:9:4
   title,
   description,
   testid = "default",
-}) {
-  return (
-    <Card style={{ width: "18rem" }} data-testid={`SignInCard-base-${testid}`}>
-      <Card.Body
-        className={"text-center"}
-        data-testid={`SignInCard-header-${testid}`}
-      >
-        <Icon />
-      </Card.Body>
-      <Card.Body>
-        <Card.Title>{title}</Card.Title>
-        <Card.Text>{description}</Card.Text>
-        <Card.Footer
-          className={"text-center"}
-          data-testid={`SignInCard-footer-${testid}`}
-        >
-          <Button href={url}>Log In</Button>
-        </Card.Footer>
-      </Card.Body>
-    </Card>
-  );
-}
+}) {}
 
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Error: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Auth/SignInCard.js:11:51
   testid = "default",
 }) {
   return (
-    <Card style={{ width: "18rem" }} data-testid={`SignInCard-base-${testid}`}>
+    <Card style={{ width: "18rem" }} data-testid={``}>
       <Card.Body
         className={"text-center"}
killedBy: SignInCard Tests Card renders with required properties
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SignInCard-base-google"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid=""

[Killed] StringLiteral
main/components/Auth/SignInCard.js:23:24
         <Card.Text>{description}</Card.Text>
         <Card.Footer
           className={"text-center"}
-          data-testid={`SignInCard-footer-${testid}`}
+          data-testid={``}
         >
           <Button href={url}>Log In</Button>
killedBy: SignInCard Tests Card renders with required properties
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SignInCard-footer-google"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="SignInCard-base-google"
