[Killed] LogicalOperator
main/components/RosterStudent/RosterStudentForm.js:73:8
         </Form.Control.Feedback>
       </Form.Group>
 
-      {!initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="email">Email</Form.Label>
-          <Form.Control
-            id="email"
-            type="text"
-            isInvalid={Boolean(errors.email)}
-            {...register("email", {
-              required: "Email is required.",
-            })}
-          />
-          <Form.Control.Feedback type="invalid">
-            {errors.email?.message}
-          </Form.Control.Feedback>
-        </Form.Group>
-      )}
+      {!initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="email">Email</Form.Label>
+          <Form.Control id="email" type="text" isInvalid={Boolean(errors.email)} {...register("email", {
+    required: "Email is required."
+  })} />
+          <Form.Control.Feedback type="invalid">
+            {errors.email?.message}
+          </Form.Control.Feedback>
+        </Form.Group>}
 
       {initialContents && (
killedBy: RosterStudentForm tests renders correctly with no initialContents
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentForm.js:73:8
         </Form.Control.Feedback>
       </Form.Group>
 
-      {!initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="email">Email</Form.Label>
-          <Form.Control
-            id="email"
-            type="text"
-            isInvalid={Boolean(errors.email)}
-            {...register("email", {
-              required: "Email is required.",
-            })}
-          />
-          <Form.Control.Feedback type="invalid">
-            {errors.email?.message}
-          </Form.Control.Feedback>
-        </Form.Group>
-      )}
+      {true}
 
       {initialContents && (
killedBy: InstructorCourseShowPage tests RosterStudentForm submit works
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Email

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentForm.js:90:8
         </Form.Group>
       )}
 
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="email">Email</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-email"}
-            id="email"
-            type="text"
-            {...register("email")}
-            value={initialContents.email}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: RosterStudentForm tests renders correctly when passing in initialContents
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
