[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.js:46:31
     setShowEditModal(false);
   };
 
-  const onEditSuccess = () => {
-    toast("Student updated successfully.");
-    hideModal();
-  };
+  const onEditSuccess = () => {};
 
   // Stryker disable next-line all
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Edit Student</div> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.js:62:34
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const editCallback = (cell) => {
-    setEditStudent(cell.row.values);
-    setShowEditModal(true);
-  };
+  const editCallback = (cell) => {};
 
   const submitEditForm = (data) => {
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Error: Unable to find an element with the text: Edit Student. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BooleanLiteral
main/components/RosterStudent/RosterStudentTable.js:64:22
 
   const editCallback = (cell) => {
     setEditStudent(cell.row.values);
-    setShowEditModal(true);
+    setShowEditModal(false);
   };
 
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Error: Unable to find an element with the text: Edit Student. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentTable.js:82:5
       accessor: "studentId",
     },
 
-    {
-      Header: "First Name",
-      accessor: "firstName",
-    },
+    {},
     {
       Header: "Last Name",
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.js:111:24
         </Modal.Header>
         <Modal.Body
           className={"pb-3"}
-          data-testid={`${testIdPrefix}-modal-body`}
+          data-testid={``}
         >
           <RosterStudentForm
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentTable-modal-body"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>
