[Killed] BlockStatement
main/components/Nav/GoogleLogin.js:4:77
 import { Button, Navbar } from "react-bootstrap";
 import { Link } from "react-router-dom";
 
-export default function GoogleLogin({ currentUser, handleLogin, doLogout }) {
-  return (
-    <>
-      {currentUser && currentUser.loggedIn ? (
-        <>
-          <Navbar.Text className="me-3" as={Link} to="/profile">
-            Welcome, {currentUser.root.user.email}
-          </Navbar.Text>
-          <Button onClick={doLogout}>Log Out</Button>
-        </>
-      ) : (
-        <Button onClick={handleLogin}>Log In</Button>
-      )}
-    </>
-  );
-}
+export default function GoogleLogin({ currentUser, handleLogin, doLogout }) {}
 
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Welcome, pconrad.cis@gmail.com. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      data-testid="App

[Killed] LogicalOperator
main/components/Nav/GoogleLogin.js:7:8
 export default function GoogleLogin({ currentUser, handleLogin, doLogout }) {
   return (
     <>
-      {currentUser && currentUser.loggedIn ? (
+      {currentUser || currentUser.loggedIn ? (
         <>
           <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: TypeError: Cannot read properties of null (reading 'user')
