[Killed] BlockStatement
main/pages/Auth/SignInPage.js:9:31
 import { useSystemInfo } from "main/utils/systemInfo";
 
 export default function SignInPage() {
-  const microsoftIcon = () => {
-    return (
-      <span data-testid={"SignInPage-microsoftIcon"}>
-        <FaMicrosoft size={"10em"} role={"img"} />
-      </span>
-    );
-  };
+  const microsoftIcon = () => {};
 
   const { data: systemInfo } = useSystemInfo();
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SignInPage-microsoftIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Auth/SignInPage.js:11:26
 export default function SignInPage() {
   const microsoftIcon = () => {
     return (
-      <span data-testid={"SignInPage-microsoftIcon"}>
+      <span data-testid={""}>
         <FaMicrosoft size={"10em"} role={"img"} />
       </span>
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SignInPage-microsoftIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Auth/SignInPage.js:33:22
         xs={1}
         md={2}
         className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
-        data-testid={"SignInPage-cardDisplay"}
+        data-testid={""}
       >
         {systemInfo.oauthLogin && (
killedBy: SignInPage Tests Base environment test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SignInPage-cardDisplay"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Auth/SignInPage.js:35:10
         className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
         data-testid={"SignInPage-cardDisplay"}
       >
-        {systemInfo.oauthLogin && (
-          <SignInCard
-            Icon={googleIcon}
-            title={"Sign in with Google"}
-            description={
-              "If you have University of California-Santa Barbara login credentials, sign in with Google"
-            }
-            url={systemInfo.oauthLogin}
-            testid={"google"}
-          />
-        )}
+        {true}
         {systemInfo.activeDirectoryUrl && (
           <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Error: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Auth/SignInPage.js:35:10
         className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
         data-testid={"SignInPage-cardDisplay"}
       >
-        {systemInfo.oauthLogin && (
-          <SignInCard
-            Icon={googleIcon}
-            title={"Sign in with Google"}
-            description={
-              "If you have University of California-Santa Barbara login credentials, sign in with Google"
-            }
-            url={systemInfo.oauthLogin}
-            testid={"google"}
-          />
-        )}
+        {false}
         {systemInfo.activeDirectoryUrl && (
           <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Error: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Auth/SignInPage.js:38:20
         {systemInfo.oauthLogin && (
           <SignInCard
             Icon={googleIcon}
-            title={"Sign in with Google"}
+            title={""}
             description={
               "If you have University of California-Santa Barbara login credentials, sign in with Google"
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Error: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Auth/SignInPage.js:46:10
             testid={"google"}
           />
         )}
-        {systemInfo.activeDirectoryUrl && (
-          <SignInCard
-            Icon={microsoftIcon}
-            title={"Sign in with Microsoft"}
-            description={
-              "If you have Oregon State University login credentials, sign in with Microsoft."
-            }
-            url={systemInfo.activeDirectoryUrl}
-            testid={"microsoft"}
-          />
-        )}
+        {false}
       </Row>
     </BasicLayout>
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Error: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Auth/SignInPage.js:46:10
             testid={"google"}
           />
         )}
-        {systemInfo.activeDirectoryUrl && (
-          <SignInCard
-            Icon={microsoftIcon}
-            title={"Sign in with Microsoft"}
-            description={
-              "If you have Oregon State University login credentials, sign in with Microsoft."
-            }
-            url={systemInfo.activeDirectoryUrl}
-            testid={"microsoft"}
-          />
-        )}
+        {true}
       </Row>
     </BasicLayout>
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Error: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Auth/SignInPage.js:49:20
         {systemInfo.activeDirectoryUrl && (
           <SignInCard
             Icon={microsoftIcon}
-            title={"Sign in with Microsoft"}
+            title={""}
             description={
               "If you have Oregon State University login credentials, sign in with Microsoft."
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Error: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
