[Killed] ObjectLiteral
src/main/pages/HomePageLoggedIn.js:27:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/courses/staffCourses"],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET.
-    { method: "GET", url: "/api/courses/staffCourses" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Error: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/HomePageLoggedIn.js:60:5
 
   const studentJoinMutation = useBackendMutation(
     cellToAxiosParamsStudent,
-    { onSuccess: onJoinSuccess, onError: onJoinFail },
+    {},
     [`/api/courses/list`],
   );
killedBy: HomePageLoggedIn tests join callbacks work
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Successfully invited student to Organization"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrayDeclaration
src/main/pages/HomePageLoggedIn.js:61:5
   const studentJoinMutation = useBackendMutation(
     cellToAxiosParamsStudent,
     { onSuccess: onJoinSuccess, onError: onJoinFail },
-    [`/api/courses/list`],
+    [],
   );
 
killedBy: HomePageLoggedIn tests join callbacks work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BlockStatement
src/main/pages/HomePageLoggedIn.js:78:38
     staffJoinMutation.mutate(cell);
   };
 
-  const isStudentJoining = (cell) => {
-    return (
-      studentJoinMutation.isLoading &&
-      studentJoinMutation.variables.row.index === cell.row.index
-    );
-  };
+  const isStudentJoining = (cell) => {};
 
   const isStaffJoining = (cell) => {
killedBy: HomePageLoggedIn tests Loading message renders, student
statusReason: Error: Unable to find an element with the text: Joining.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/HomePageLoggedIn.js:80:7
 
   const isStudentJoining = (cell) => {
     return (
-      studentJoinMutation.isLoading &&
-      studentJoinMutation.variables.row.index === cell.row.index
+      studentJoinMutation.isLoading || studentJoinMutation.variables.row.index === cell.row.index
     );
   };
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'row')

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.js:80:7
 
   const isStudentJoining = (cell) => {
     return (
-      studentJoinMutation.isLoading &&
-      studentJoinMutation.variables.row.index === cell.row.index
+      false
     );
   };
killedBy: HomePageLoggedIn tests Loading message renders, student
statusReason: Error: Unable to find an element with the text: Joining.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
src/main/pages/HomePageLoggedIn.js:81:7
   const isStudentJoining = (cell) => {
     return (
       studentJoinMutation.isLoading &&
-      studentJoinMutation.variables.row.index === cell.row.index
+      studentJoinMutation.variables.row.index !== cell.row.index
     );
   };
killedBy: HomePageLoggedIn tests Loading message renders, student
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Join Course
Received:
  Joining...

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.js:81:7
   const isStudentJoining = (cell) => {
     return (
       studentJoinMutation.isLoading &&
-      studentJoinMutation.variables.row.index === cell.row.index
+      true
     );
   };
killedBy: HomePageLoggedIn tests Loading message renders, student
statusReason: Error: Found multiple elements with the text: Joining...

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="btn btn-primary"
  data-testid="CoursesTable-cell-row-1-col-studentStatus-button"

[Killed] BlockStatement
src/main/pages/HomePageLoggedIn.js:85:36
     );
   };
 
-  const isStaffJoining = (cell) => {
-    return (
-      staffJoinMutation.isLoading &&
-      staffJoinMutation.variables.row.index === cell.row.index
-    );
-  };
+  const isStaffJoining = (cell) => {};
 
   return (
killedBy: HomePageLoggedIn tests Loading message renders, staff
statusReason: Error: Unable to find an element with the text: Joining.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.js:87:7
 
   const isStaffJoining = (cell) => {
     return (
-      staffJoinMutation.isLoading &&
-      staffJoinMutation.variables.row.index === cell.row.index
+      false
     );
   };
killedBy: HomePageLoggedIn tests Loading message renders, staff
statusReason: Error: Unable to find an element with the text: Joining.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/HomePageLoggedIn.js:87:7
 
   const isStaffJoining = (cell) => {
     return (
-      staffJoinMutation.isLoading &&
-      staffJoinMutation.variables.row.index === cell.row.index
+      staffJoinMutation.isLoading || staffJoinMutation.variables.row.index === cell.row.index
     );
   };
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'row')

[Killed] EqualityOperator
src/main/pages/HomePageLoggedIn.js:88:7
   const isStaffJoining = (cell) => {
     return (
       staffJoinMutation.isLoading &&
-      staffJoinMutation.variables.row.index === cell.row.index
+      staffJoinMutation.variables.row.index !== cell.row.index
     );
   };
killedBy: HomePageLoggedIn tests Loading message renders, staff
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Join Course
Received:
  Joining...

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.js:88:7
   const isStaffJoining = (cell) => {
     return (
       staffJoinMutation.isLoading &&
-      staffJoinMutation.variables.row.index === cell.row.index
+      true
     );
   };
killedBy: HomePageLoggedIn tests Loading message renders, staff
statusReason: Error: Found multiple elements with the text: Joining...

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="btn btn-primary"
  data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"
