[Killed] ConditionalExpression
src/main/pages/HomePageConnectGithub.js:20:5
   const { data: systemInfo } = useSystemInfo();
 
   var githubOauthLogin =
-    systemInfo?.githubOauthLogin || "/oauth2/authorization/github";
+    false;
 
   return (
killedBy: HomePageConnectGithub tests renders without crashing
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/github") // element.getAttribute("href") === "/oauth2/authorization/github"

Expected the element to have attribute:
  href="/oauth2/authorization/github"
Received:
  null

[Killed] StringLiteral
src/main/pages/HomePageConnectGithub.js:28:22
         xs={1}
         md={2}
         className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
-        data-testid={"HomePageConnectGithub-cardDisplay"}
+        data-testid={""}
       >
         <SignInCard
killedBy: HomePageConnectGithub tests Base environment test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HomePageConnectGithub-cardDisplay"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/HomePageConnectGithub.js:34:13
           Icon={githubIcon}
           title={"Sign in with Github"}
           description={
-            "Please connect your account with a GitHub account to continue to Frontiers."
+            ""
           }
           url={githubOauthLogin}
killedBy: HomePageConnectGithub tests renders without crashing
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
