[Killed] ArrayDeclaration
main/pages/Instructor/InstructorCourseShowPage.js:41:5
     error: _errorRosterStudents,
     status: _statusRosterStudents,
   } = useBackend(
-    [`/api/rosterstudents/course/${courseId}`],
+    [],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/rosterstudents/course/${courseId}` },
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.js:49:19
   );
 
   const navigate = useNavigate();
-  useEffect(() => {
-    if (getCourseFailed) {
-      setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate("/instructor/courses", { replace: true });
-      }, 3000);
-      return () => {
-        clearTimeout(timer);
-      };
-    }
-  }, [getCourseFailed, navigate]);
+  useEffect(() => {}, [getCourseFailed, navigate]);
 
   const objectToAxiosParamsCSV = (formData) => {
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Error: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.js:50:26
 
   const navigate = useNavigate();
   useEffect(() => {
-    if (getCourseFailed) {
-      setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate("/instructor/courses", { replace: true });
-      }, 3000);
-      return () => {
-        clearTimeout(timer);
-      };
-    }
+    if (getCourseFailed) {}
   }, [getCourseFailed, navigate]);
 
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Error: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.js:52:38
   useEffect(() => {
     if (getCourseFailed) {
       setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate("/instructor/courses", { replace: true });
-      }, 3000);
+      const timer = setTimeout(() => {}, 3000);
       return () => {
         clearTimeout(timer);
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/instructor/courses", {"replace": true}

Number of calls: 0

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.js:53:52
     if (getCourseFailed) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
-        navigate("/instructor/courses", { replace: true });
+        navigate("/instructor/courses", { replace: false });
       }, 3000);
       return () => {
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/instructor/courses",
  Object {
-   "replace": true,

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.js:55:20
       const timer = setTimeout(() => {
         navigate("/instructor/courses", { replace: true });
       }, 3000);
-      return () => {
-        clearTimeout(timer);
-      };
+      return () => {};
     }
   }, [getCourseFailed, navigate]);
killedBy: InstructorCourseShowPage tests Cleans up correctly on unmount
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 8
Received:    7

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.js:61:48
     }
   }, [getCourseFailed, navigate]);
 
-  const objectToAxiosParamsCSV = (formData) => {
-    const file = new FormData();
-    file.append("file", formData.upload[0]);
-    return {
-      url: `/api/rosterstudents/upload/egrades`,
-      data: file,
-      params: {
-        courseId: courseId,
-      },
-      method: "POST",
-    };
-  };
+  const objectToAxiosParamsCSV = (formData) => {};
 
   const objectToAxiosParamsPost = (student) => ({
killedBy: InstructorCourseShowPage tests Successfully makes a call to the backend on submit
statusReason: TypeError: Cannot read properties of undefined (reading 'params')

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style="padding-right: 1024px;"

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.js:86:27
     },
   });
 
-  const onSuccess = () => {
-    toast("Roster successfully updated.");
-  };
+  const onSuccess = () => {};
 
   const rosterPostMutation = useBackendMutation(
killedBy: InstructorCourseShowPage tests Successfully makes a call to the backend on submit
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Roster successfully updated."

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Instructor/InstructorCourseShowPage.js:92:5
 
   const rosterPostMutation = useBackendMutation(
     objectToAxiosParamsPost,
-    { onSuccess: onSuccess },
+    {},
     [`/api/rosterstudents/course/${courseId}`],
   );
killedBy: InstructorCourseShowPage tests RosterStudentForm submit works
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/pages/Instructor/InstructorCourseShowPage.js:93:5
   const rosterPostMutation = useBackendMutation(
     objectToAxiosParamsPost,
     { onSuccess: onSuccess },
-    [`/api/rosterstudents/course/${courseId}`],
+    [],
   );
 
killedBy: InstructorCourseShowPage tests RosterStudentForm submit works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.js:127:24
           </Button>
         </Modal.Footer>
       </Modal>
-      <h1 data-testid={`${testId}-title`}>
+      <h1 data-testid={``}>
         Course: {course ? `${course.courseName} (${course.id})` : "Loading..."}
       </h1>
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Error: Unable to find an element by: [data-testid="InstructorCourseShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.js:128:67
         </Modal.Footer>
       </Modal>
       <h1 data-testid={`${testId}-title`}>
-        Course: {course ? `${course.courseName} (${course.id})` : "Loading..."}
+        Course: {course ? `${course.courseName} (${course.id})` : ""}
       </h1>
       <Tabs defaultActiveKey={"default"}>
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Course: Loading...
Received:
  Course:

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.js:131:24
         Course: {course ? `${course.courseName} (${course.id})` : "Loading..."}
       </h1>
       <Tabs defaultActiveKey={"default"}>
-        <Tab eventKey={"default"} title={"Management"} className="pt-2">
+        <Tab eventKey={""} title={"Management"} className="pt-2">
           <InstructorCoursesTable
             courses={course ? [course] : []}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Error: expect(element).toHaveAttribute("data-rr-ui-event-key", "default") // element.getAttribute("data-rr-ui-event-key") === "default"

Expected the element to have attribute:
  data-rr-ui-event-key="default"
Received:
  data-rr-ui-event-key=""

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.js:131:42
         Course: {course ? `${course.courseName} (${course.id})` : "Loading..."}
       </h1>
       <Tabs defaultActiveKey={"default"}>
-        <Tab eventKey={"default"} title={"Management"} className="pt-2">
+        <Tab eventKey={"default"} title={""} className="pt-2">
           <InstructorCoursesTable
             courses={course ? [course] : []}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: TestingLibraryElementError: Unable to find an element with the text: Management. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.js:138:45
             testId={testId}
           />
         </Tab>
-        <Tab eventKey={"enrollment"} title={"Enrollment"} className="pt-2">
+        <Tab eventKey={"enrollment"} title={""} className="pt-2">
           <Row className="py-3">
             <Accordion defaultActiveKey="upload">
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: TestingLibraryElementError: Unable to find an element with the text: Enrollment. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.js:138:24
             testId={testId}
           />
         </Tab>
-        <Tab eventKey={"enrollment"} title={"Enrollment"} className="pt-2">
+        <Tab eventKey={""} title={"Enrollment"} className="pt-2">
           <Row className="py-3">
             <Accordion defaultActiveKey="upload">
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Error: expect(element).toHaveAttribute("data-rr-ui-event-key", "enrollment") // element.getAttribute("data-rr-ui-event-key") === "enrollment"

Expected the element to have attribute:
  data-rr-ui-event-key="enrollment"
Received:
  data-rr-ui-event-key=""

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.js:161:25
           <Row>
             <RosterStudentTable
               // Stryker disable next-line ArrayDeclaration : checking for ["Stryker was here"] is tough
-              students={rosterStudents || []}
+              students={false}
               currentUser={currentUser}
               courseId={course ? course.id : ""}
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: TypeError: data.forEach is not a function

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.js:161:25
           <Row>
             <RosterStudentTable
               // Stryker disable next-line ArrayDeclaration : checking for ["Stryker was here"] is tough
-              students={rosterStudents || []}
+              students={true}
               currentUser={currentUser}
               courseId={course ? course.id : ""}
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: TypeError: data.forEach is not a function
