[Killed] StringLiteral
main/components/Common/ConfirmationModal.js:40:20
             onYes();
             closeModal();
           }}
-          variant={"danger"}
+          variant={""}
         >
           Yes, I'd like to do this
killedBy: Sanity Check Modal works as designed
statusReason: Error: expect(element).toHaveClass("ms-auto btn-danger")

Expected the element to have class:
  ms-auto btn-danger
Received:
  ms-auto btn
