[Killed] ObjectLiteral
main/components/Courses/CourseModal.js:76:38
               id="school"
               type="text"
               isInvalid={Boolean(errors.school)}
-              {...register("school", {
-                required: "School is required.",
-              })}
+              {...register("school", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: CourseModal Tests Validation works correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>
