[Killed] BlockStatement
main/components/Courses/CoursesTable.js:76:39
       Header: "Status",
       accessor: "studentStatus",
       Cell: ({ cell }) => {
-        if (cell.value === "PENDING") {
-          return (
-            <OverlayTrigger
-              placement="right"
-              overlay={renderTooltip("PENDING")}
-            >
-              <span style={{ color: "orange" }}>Pending</span>
-            </OverlayTrigger>
-          );
-        } else if (cell.value === "JOINCOURSE") {
+        if (cell.value === "PENDING") {} else if (cell.value === "JOINCOURSE") {
           const cellIsLoading = isLoading(cell);
           return (
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Pending
Received:
  PENDING

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:85:20
               <span style={{ color: "orange" }}>Pending</span>
             </OverlayTrigger>
           );
-        } else if (cell.value === "JOINCOURSE") {
+        } else if (true) {
           const cellIsLoading = isLoading(cell);
           return (
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Found multiple elements with the text: Join Course

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="btn btn-primary"
  data-testid="CoursesTable-cell-row-1-col-studentStatus-button"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:85:20
               <span style={{ color: "orange" }}>Pending</span>
             </OverlayTrigger>
           );
-        } else if (cell.value === "JOINCOURSE") {
+        } else if (false) {
           const cellIsLoading = isLoading(cell);
           return (
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Join Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:116:46
               </span>
             </OverlayTrigger>
           );
-        } else if (cell.value === "INVITED") {
-          return (
-            <OverlayTrigger
-              placement="right"
-              overlay={renderTooltip("INVITED")}
-            >
-              <span>
-                <Button
-                  variant={"primary"}
-                  onClick={() => viewInviteCallback(cell)}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-                >
-                  View Invite
-                </Button>
-              </span>
-            </OverlayTrigger>
-          );
-        } else if (cell.value === "OWNER") {
+        } else if (cell.value === "INVITED") {} else if (cell.value === "OWNER") {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
killedBy: CoursesTable tests Does not call joinCallback in default case for button'View Invite'
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-2-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:126:32
                 <Button
                   variant={"primary"}
                   onClick={() => viewInviteCallback(cell)}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
+                  data-testid={``}
                 >
                   View Invite
killedBy: CoursesTable tests Does not call joinCallback in default case for button'View Invite'
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-2-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:133:20
               </span>
             </OverlayTrigger>
           );
-        } else if (cell.value === "OWNER") {
+        } else if (false) {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Owner. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:136:28
         } else if (cell.value === "OWNER") {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
-              <span style={{ color: "purple" }}>Owner</span>
+              <span style={{}}>Owner</span>
             </OverlayTrigger>
           );
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveStyle()

- Expected

- color: purple;

[Killed] EqualityOperator
main/components/Courses/CoursesTable.js:139:20
               <span style={{ color: "purple" }}>Owner</span>
             </OverlayTrigger>
           );
-        } else if (cell.value === "MEMBER") {
+        } else if (cell.value !== "MEMBER") {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Illegal status that will never occur. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:139:20
               <span style={{ color: "purple" }}>Owner</span>
             </OverlayTrigger>
           );
-        } else if (cell.value === "MEMBER") {
+        } else if (false) {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:142:37
         } else if (cell.value === "MEMBER") {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
-              <span style={{ color: "blue" }}>Member</span>
+              <span style={{ color: "" }}>Member</span>
             </OverlayTrigger>
           );
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveStyle()

- Expected

- color: blue;

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:142:28
         } else if (cell.value === "MEMBER") {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
-              <span style={{ color: "blue" }}>Member</span>
+              <span style={{}}>Member</span>
             </OverlayTrigger>
           );
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveStyle()

- Expected

- color: blue;
