[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:17:17
     Cell: ({ cell }) => {
       return (
         <a
-          href={`/instructor/courses/${cell.row.values.id}`}
+          href={``}
           data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
         >
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: Error: expect(element).toHaveAttribute("href", "/instructor/courses/1") // element.getAttribute("href") === "/instructor/courses/1"

Expected the element to have attribute:
  href="/instructor/courses/1"
Received:
  href=""

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:50:31
     window.location.href = url;
   };
 
-  const canInstall = (row) => {
-    if ("orgName" in row.values && row.values.orgName) {
-      return false;
-    }
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
-    }
-    if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.values.createdByEmail === currentUser.root.user.email
-    ) {
-      return true;
-    }
-
-    return false;
-  };
+  const canInstall = (row) => {};
 
   const columnsWithInstall = [
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.js:51:9
   };
 
   const canInstall = (row) => {
-    if ("orgName" in row.values && row.values.orgName) {
+    if (true) {
       return false;
     }
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:51:56
   };
 
   const canInstall = (row) => {
-    if ("orgName" in row.values && row.values.orgName) {
-      return false;
-    }
+    if ("orgName" in row.values && row.values.orgName) {}
     if (hasRole(currentUser, "ROLE_ADMIN")) {
       return true;
killedBy: CoursesIndexPage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: wsu-cpts489-fa20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.js:52:14
 
   const canInstall = (row) => {
     if ("orgName" in row.values && row.values.orgName) {
-      return false;
+      return true;
     }
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ucsb-cs156-s25
Received:
  Install Github App

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:60:7
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
       row.values.createdByEmail === currentUser.root.user.email
-    ) {
-      return true;
-    }
+    ) {}
 
     return false;
killedBy: CoursesIndexPage tests renders correctly for instructor user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:74:21
       accessor: "orgName",
       Cell: ({ cell }) => {
         const result = canInstall(cell.row);
-        if (result) {
-          return (
-            <Button
-              variant={"primary"}
-              onClick={() => installCallback(cell)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-            >
-              Install Github App
-            </Button>
-          );
-        } else if (!cell.value) {
+        if (result) {} else if (!cell.value) {
           return (
             <span
killedBy: CoursesIndexPage tests renders correctly for instructor user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.js:84:20
               Install Github App
             </Button>
           );
-        } else if (!cell.value) {
+        } else if (cell.value) {
           return (
             <span
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ucsb-cs156-s25
Received:

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.js:84:20
               Install Github App
             </Button>
           );
-        } else if (!cell.value) {
+        } else if (true) {
           return (
             <span
killedBy: CoursesIndexPage tests renders correctly for instructor user
statusReason: TestingLibraryElementError: Unable to find an element with the text: wsu-cpts489-fa20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:112:25
               </span>
               <span>
                 <a
-                  href={`https://github.com/organizations/${cell.value}/settings/installations/${cell.row.original.installationId}`}
+                  href={``}
                   target="_blank"
                   rel="noopener noreferrer"
killedBy: InstructorCoursesTable tests Tests for Github link and icon
statusReason: Error: expect(element).toHaveAttribute("href", "https://github.com/organizations/ucsb-cs156-s25/settings/installations/123456") // element.getAttribute("href") === "https://github.com/organizations/ucsb-cs156-s25/settings/installations/123456"

Expected the element to have attribute:
  href="https://github.com/organizations/ucsb-cs156-s25/settings/installations/123456"
Received:
  href=""
