[Killed] BlockStatement
main/components/Nav/AppNavbar.js:15:30
   currentUrl = window.location.href,
 }) {
   const navigation = useNavigate();
-  const handleSignIn = () => {
-    navigation("/login");
-  };
+  const handleSignIn = () => {};
   return (
     <>
killedBy: AppNavbar tests onclick navigates to login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/login"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:44:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {systemInfo?.showSwaggerUILink && (
-                <>
-                  <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-                </>
-              )}
+              {true}
               {systemInfo?.springH2ConsoleEnabled && (
                 <>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      data-testid="AppNa

[Killed] OptionalChaining
main/components/Nav/AppNavbar.js:49:16
                   <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
                 </>
               )}
-              {systemInfo?.springH2ConsoleEnabled && (
+              {systemInfo.springH2ConsoleEnabled && (
                 <>
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'springH2ConsoleEnabled')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:49:16
                   <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
                 </>
               )}
-              {systemInfo?.springH2ConsoleEnabled && (
-                <>
-                  <Nav.Link href="/h2-console">H2Console</Nav.Link>
-                </>
-              )}
+              {true}
               {hasRole(currentUser, "ROLE_ADMIN") && (
                 <NavDropdown
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:54:16
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 </>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/instructors">
-                    Instructors
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
+                  <NavDropdown.Item href="/admin/admins">
+                    Admins
+                  </NavDropdown.Item>
+                  <NavDropdown.Item href="/admin/instructors">
+                    Instructors
+                  </NavDropdown.Item>
+                </NavDropdown>}
               {hasRole(currentUser, "ROLE_INSTRUCTOR") && (
                 <NavDropdown
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:54:16
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 </>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/admins">
-                    Admins
-                  </NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/instructors">
-                    Instructors
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
               {hasRole(currentUser, "ROLE_INSTRUCTOR") && (
                 <NavDropdown
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:69:16
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {hasRole(currentUser, "ROLE_INSTRUCTOR") && (
-                <NavDropdown
-                  title="Instructor"
-                  id="appnavbar-instructor-dropdown"
-                  data-testid="appnavbar-instructor-dropdown"
-                >
-                  <NavDropdown.Item href="/instructor/courses">
-                    Courses
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_INSTRUCTOR") || <NavDropdown title="Instructor" id="appnavbar-instructor-dropdown" data-testid="appnavbar-instructor-dropdown">
+                  <NavDropdown.Item href="/instructor/courses">
+                    Courses
+                  </NavDropdown.Item>
+                </NavDropdown>}
             </Nav>
             {hasRole(currentUser, "ROLE_GITHUB") && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-instructor-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:81:14
                 </NavDropdown>
               )}
             </Nav>
-            {hasRole(currentUser, "ROLE_GITHUB") && (
-              <Nav className="ml-auto">
-                <GithubLogin
-                  currentUser={currentUser}
-                  systemInfo={systemInfo}
-                />
-              </Nav>
-            )}
+            {hasRole(currentUser, "ROLE_GITHUB") || <Nav className="ml-auto">
+                <GithubLogin currentUser={currentUser} systemInfo={systemInfo} />
+              </Nav>}
             <Nav className="ml-auto">
               <GoogleLogin
killedBy: AppNavbar tests If user does have ROLE_GITHUB, it does renders the connected to github
statusReason: TestingLibraryElementError: Unable to find an element with the text: Github: cgaucho-github. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-md navbar-dark bg-dark sticky-top"
      dat
