[Killed] LogicalOperator
main/components/RosterStudent/RosterStudentCSVUploadForm.js:25:12
           {...register("upload", { required: true })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.upload && "Roster is required. "}
+          {errors.upload || "Roster is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RosterStudentCSVUploadForm Tests No errors on good submit
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Roster is required. </div> instead

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentCSVUploadForm.js:25:12
           {...register("upload", { required: true })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.upload && "Roster is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RosterStudentCSVUploadForm Tests Required fires when there's no input
statusReason: Error: Unable to find an element with the text: /Roster is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
