[Killed] BlockStatement
src/main/pages/HomePageLoggedOut.js:5:45
 
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function HomePageLoggedOut() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Welcome to Frontiers!</h1>
-        <p>This is the MVP for the Frontiers Project.</p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function HomePageLoggedOut() {}
 
killedBy: HomePageLoggedOut tests renders without crashing
statusReason: Error: Unable to find an element with the text: /Welcome to Frontiers!/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
