[Killed] BlockStatement
src/main/pages/LoadingPage.js:3:39
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function LoadingPage() {
-  return (
-    <div data-testid={"LoadingPage-main-div"}>
-      <BasicLayout></BasicLayout>
-    </div>
-  );
-}
+export default function LoadingPage() {}
 
killedBy: LoadingPage tests renders without crashing when lists return empty list
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LoadingPage-main-div"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
