[Killed] ArrayDeclaration
src/main/pages/ProfilePage.js:26:5
       };
     },
     { onSuccess: onSuccess },
-    ["current user"],
+    [],
   );
 
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:68:10
       </Row>
       <Row className={"mt-3 g-3"} data-testid={"ProfilePage-advancedFeatures"}>
         <h2>Advanced Features</h2>
-        {hasRole(currentUser, "ROLE_GITHUB") && (
-          <>
-            <Col md={2}>
-              <Button variant={"danger"} onClick={() => setViewModal(true)}>
-                Disconnect GitHub
-              </Button>
-            </Col>
-          </>
-        )}
+        {true}
       </Row>
     </BasicLayout>
killedBy: ProfilePage tests GitHub disconnect appears
statusReason: Error: Unable to find an element with the text: Disconnect GitHub. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
