[Timeout] BlockStatement
src/main/utils/currentUser.js:5:34
 import axios from "axios";
 import { useNavigate } from "react-router-dom";
 
-export function useCurrentUser() {
-  let rolesList = ["ERROR_GETTING_ROLES"];
-  const queryResults = useQuery(
-    "current user",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-      }
-    },
-    {
-      initialData: { loggedIn: false, root: null, initialData: true },
-    },
-  );
-  return queryResults.data;
-}
+export function useCurrentUser() {}
 
 export function useLogout() {

[Killed] StringLiteral
src/main/utils/currentUser.js:35:36
   const navigate = useNavigate();
   const mutation = useMutation(async () => {
     await axios.post("/logout");
-    await queryClient.resetQueries("current user", { exact: true });
+    await queryClient.resetQueries("", { exact: true });
     navigate("/");
   });
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "current user",
+ "",
  {"exact": true},

[Killed] ConditionalExpression
src/main/utils/currentUser.js:42:7
 }
 
 export function hasRole(currentUser, role) {
-  if (currentUser == null) return false;
+  if (true) return false;
 
   return currentUser.root?.rolesList?.includes(role);
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: Error: expect(received).toBeTruthy()

Received: false
